Tekla Open API Reference for Tekla Structures 2025
Dialogs.ClosePluginDialogs Method
 Close all dialogs to end the threads running the corresponding message loops.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static void ClosePluginDialogs()
Public Shared Sub ClosePluginDialogs
See Also
Reference
Dialogs Class
Tekla.Structures.Dialog Namespace